app/controllers/admins_controller.rb

  def show
    @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", "1"]]