app/controllers/batchs_controller.rb

SELECT "batches".* FROM "batches"
---
  def index
    @batchs = Batch.all