app/controllers/forums_controller.rb

  def filter_forum
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"