app/controllers/jktests_controller.rb

  def select_subject
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"