app/controllers/profile_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = 1 LIMIT 1
SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    respond_to do |format|
      if current_user.role.name == "student"
        @student = Student.find(current_user.employee_id)
        @batchs = Batch.where("id in (?)", Batchstudent.find(:all, :conditions => { :student_id => current_user.employee_id}).map(&:batch_id))
        @marks = Mark.find(:all, :conditions => {:student_id => @student.id})
      elsif current_user.role.name == "Admin"
        @admin = Admin.find(current_user.employee_id)
      elsif current_user.role.name == "teacher"
        @teacher = Teacher.find(current_user.employee_id)

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    if current_user.role.name == "student"
      @student = Student.find(params[:id])
    elsif current_user.role.name == "Admin"
      @admin = Admin.find(params[:id])
    else
      @teacher = Teacher.find(params[:id])