app/controllers/questions_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def filter_question
    @subjects = Subject.all