app/controllers/reports_controller.rb

  def index
    @batches = Batch.all
    @students = Student.all
    @jktests = Jktest.all
    @marks = Mark.all
---
SELECT "batches".* FROM "batches"
SELECT "students".* FROM "students"
SELECT "jktests".* FROM "jktests"
SELECT "marks".* FROM "marks"