app/controllers/users_controller.rb

  def index
    respond_to do |format|
      @users = User.where("role_id != 1")
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1